CppTraingSlides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>C++ Training</title>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">C++ Training</h1>
</section>


<section>
<section id="slide-org25a05c9">
<h2 id="org25a05c9">Introduction</h2>
<p>
C++ is a statically typed, compiled, general-purpose, case-sensitive, free-form programming language that supports procedural,
object-oriented, and generic programming paradigms.
</p>
</section>
<section id="slide-org138b708">
<h3 id="org138b708">Standard</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Year</th>
<th scope="col" class="org-left">C++ Standard</th>
<th scope="col" class="org-left">Name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1998</td>
<td class="org-left">ISO/IEC 14882:1998</td>
<td class="org-left">C++98</td>
</tr>

<tr>
<td class="org-right">2003</td>
<td class="org-left">ISO/IEC 14882:2003</td>
<td class="org-left">C++03</td>
</tr>

<tr>
<td class="org-right">2011</td>
<td class="org-left">ISO/IEC 14882:2011</td>
<td class="org-left">C++11</td>
</tr>

<tr>
<td class="org-right">2014</td>
<td class="org-left">ISO/IEC 14882:2014</td>
<td class="org-left">C++14</td>
</tr>

<tr>
<td class="org-right">2017</td>
<td class="org-left">ISO/IEC 14882:2017</td>
<td class="org-left">C++17</td>
</tr>
</tbody>
</table>

</section>
</section>
<section>
<section id="slide-org2da31b4">
<h2 id="org2da31b4">Hello World</h2>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Used for output data to console</span>

<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Program starts here</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
     <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Display this message</span>
     <span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"Hello, world. "</span> &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Program return successfully</span>
     <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Hello</td>
<td class="org-left">world.</td>
</tr>
</tbody>
</table>

</section>
</section>
<section>
<section id="slide-org86f34f8">
<h2 id="org86f34f8">History</h2>
<p>
C++ was developed by Bjarne Stroustrup starting in 1979 at Bell Labs in Murray Hill, New Jersey,
as an enhancement to the C language and originally named C with Classes but later it was renamed 
C++ in 1983.
</p>
</section>
</section>
<section>
<section id="slide-org2ad4179">
<h2 id="org2ad4179">Setup</h2>
<p>
For windows we can download latest precompiled binaries for gcc tool chain at tdm-gcc.trdragon.org
</p>



</section>
</section>
<section>
<section id="slide-org5dda888">
<h2 id="org5dda888">Build Tools</h2>
<p>
gnu toolchain provide g++ command to build executable from source code.
</p>
<div class="org-src-container">

<pre  class="src src-shell">g++ Program.cpp
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org405bb96">
<h2 id="org405bb96">Popular Tools</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tools</th>
<th scope="col" class="org-left">Platforms</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Visual Studio</td>
<td class="org-left">Windows</td>
</tr>

<tr>
<td class="org-left">Xcode</td>
<td class="org-left">Mac</td>
</tr>

<tr>
<td class="org-left">CodeBlock</td>
<td class="org-left">Windows</td>
</tr>

<tr>
<td class="org-left">QT Creator</td>
<td class="org-left">Windows, linux and Mac</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

</section>
</section>
<section>
<section id="slide-orgb466c16">
<h2 id="orgb466c16">Build Process</h2>
<div class="outline-text-2" id="text-orgb466c16">
</div>
</section>
<section id="slide-org8724660">
<h3 id="org8724660">Compiling</h3>
<div class="org-src-container">

<pre  class="src src-shell">g++ --std=c++y hello.cpp -o hello.cpp
</pre>
</div>

</section>
<section id="slide-orgd5fe32b">
<h3 id="orgd5fe32b">Linking</h3>
<p>
Converting C++ source code in machine language which can be exectured by underline microprocessor
is called as build process.
</p>
</section>
</section>
<section>
<section id="slide-org24602b8">
<h2 id="org24602b8">Language Features</h2>
<ol>
<li>Statically typed</li>
<li>Support procedural , object oriented and generic programming paradigms</li>
<li>Compiled</li>
<li>Versatile standard library</li>
<li>Encapsulation</li>
<li>Inheritance</li>
<li>Polymorphism</li>

</ol>


</section>
</section>
<section>
<section id="slide-org13c5b4e">
<h2 id="org13c5b4e">Variables and Fundamental Data Types</h2>
<p>
A variable is a named piece of memory a programmer defines.
Every variable has a type which defines what kind of data it can store.
</p>
</section>
<section id="slide-org0bd3ae8">
<h3 id="org0bd3ae8">Variable Type</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Meaning</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">boolean</td>
<td class="org-left">bool</td>
<td class="org-left">true or false</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Character</td>
<td class="org-left">char</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Integer</td>
<td class="org-left">short,int,long,long long</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">floating</td>
<td class="org-left">float, double,long double</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">void</td>
<td class="org-left">no type</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</section>
<section id="slide-org1fa447b">
<h3 id="org1fa447b">bool</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span> 
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> 
<span style="color: #4f97d7;">{</span>
<span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #a45bad;">std</span>::boolalpha &lt;&lt; <span style="color: #a45bad;">true</span> &lt;&lt; <span style="color: #a45bad;">std</span>::endl; 
<span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #a45bad;">std</span>::boolalpha &lt;&lt; <span style="color: #a45bad;">false</span> &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
 <span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #a45bad;">std</span>::noboolalpha &lt;&lt; <span style="color: #a45bad;">true</span> &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
 <span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #a45bad;">std</span>::noboolalpha &lt;&lt; <span style="color: #a45bad;">false</span> &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
<span style="color: #4f97d7;">}</span> 
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">true</td>
</tr>

<tr>
<td class="org-right">false</td>
</tr>

<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
</tr>
</tbody>
</table>


</section>
<section id="slide-orge4c2411">
<h3 id="orge4c2411">Variable initialization</h3>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">Number_of_Employee</span> = <span style="color: #a45bad;">100</span>;
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Uniform initialization</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">Number_Of_Employee</span> = <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">}</span>;
</pre>
</div>
</section>
<section id="slide-org3dc6ff7">
<h3 id="org3dc6ff7">Signed integer Data Types</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-right">Size</th>
<th scope="col" class="org-left">Range</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">signed char</td>
<td class="org-right">1</td>
<td class="org-left">-128 to 127</td>
</tr>

<tr>
<td class="org-left">short</td>
<td class="org-right">2</td>
<td class="org-left">-256 to 255</td>
</tr>

<tr>
<td class="org-left">signed int</td>
<td class="org-right">4</td>
<td class="org-left">-2147483648 to 2147483647</td>
</tr>

<tr>
<td class="org-left">long int</td>
<td class="org-right">8</td>
<td class="org-left">-9223372036854775808 to 9223372036854775807</td>
</tr>
</tbody>
</table>

</section>
<section id="slide-org6e53a9c">
<h3 id="org6e53a9c">Varible with fixed values</h3>
</section>
<section id="slide-org9008112">
<h3 id="org9008112">Integer Literals</h3>
</section>
