CppTraingSlides.org
** Floating point Literals
** Character Literals
** Sting Literals
** Sizeof operator
Is used to obtain the number of bytes occupied by the type, variable or result of an expression.

* Complex Data Structure
** Array
** String
** Structure
** Unions
** Enumerations

* Flow Control
** if
** while
** for
** switch
* Operators
** Arithmetic
| Operations     | Operators | C++        |
|----------------+-----------+------------|
| Addition       | +         | count + 10 |
| Subtraction    | -         | count - 10 |
| Multiplication | *         | count * 10 |
| Division       | /         | count / 10 |
| Reminder       | %         | count % 10 |

Interger division always produce integer output for eg.
#+BEGIN_SRC C++ :exports both
#include <iostream>  //Used for output data to console

int main()
{
std::cout << "Division 7/2 = " << 7/2 << std::endl;
std::cout << "Reminder 7%2 = " << 7%2 << std::endl;
return 0;
}
#+END_SRC

#+RESULTS:
| Division | 7/2 | = | 3 |
| Reminder | 7%2 | = | 1 |

*** Prcedence of arithmetic operators
| Operator | order of evluation                      |
|----------+-----------------------------------------|
| ()       | Evaluated first.                        |
| * /  %   | Evaluated second in left to right order |
| +  -     | Evaluated last in left to right order   |


** Comparison
For various logical condition checking we need to compare to variables using comparison operator.
| Operator | Sample | Meaning                    |
|----------+--------+----------------------------|
| >        | x > y  | x is greater than y        |
| <        | x < y  | x is less than y           |
| >=       | x >= y | x is greater or equal to y |
| <=       | x <=y  | x is less or equal to y    |
| ==       | x == y | if x is equal to y         |
| !=       | x != y | if x is not equal to y     |

Reversing order of operators may cause complier to emit syntax error. But some operator like != when 
written like =! will be logical error.
Also equality operator == when written like = will be logical error.
*** Prcedence of comparison operators
| Operator  | order of evluation                      |
|-----------+-----------------------------------------|
| ()        | Evaluated first.                        |
| * /  %    | Evaluated second in left to right order |
| << >>     |                                         |
| < <= > >= |                                         |
| == !=     |                                         |
| =         |                                       |

** Bitwise
** Increament and Decreament 
*** Postfix Increament
#+BEGIN_SRC C++ :exports both
  #include <iostream> 
  int main() 
  {
     int total = 0;
     int count = 5;
    std::cout << "count\t" << count << std::endl << "total\t" << total << std::endl ;
    count = total++  + 20; 
    std::cout << "count\t" << count << std::endl << "total\t" << total  << std::endl;
    }
#+END_SRC

#+RESULTS:
| count |  5 |
| total |  0 |
| count | 20 |
| total |  1 |
*** Prefix Increament
#+BEGIN_SRC C++ :exports both
  #hinclude <iostream> 
  int main() 
  {
     int total = 0;
     int count = 5;
    std::cout << "count\t" << count << std::endl << "total\t" << total << std::endl ;
    count = ++total+ 20; 
    std::cout << "count\t" << count << std::endl << "total\t" << total  << std::endl;
    }
#+END_SRC

#+RESULTS:
| count |  5 |
| total |  0 |
| count | 21 |
| total |  1 |

* Iteration

* Functions
** Prototype
** Parameters
** inline 
