CppTraingSlides.html
<section id="slide-org5b39a07">
<h3 id="org5b39a07">Floating point Literals</h3>
</section>
<section id="slide-org61874ed">
<h3 id="org61874ed">Character Literals</h3>
</section>
<section id="slide-org49416d9">
<h3 id="org49416d9">Sting Literals</h3>
</section>
<section id="slide-org3198a8a">
<h3 id="org3198a8a">Sizeof operator</h3>
<p>
Is used to obtain the number of bytes occupied by the type, variable or result of an expression.
</p>

</section>
</section>
<section>
<section id="slide-orgd144e7c">
<h2 id="orgd144e7c">Complex Data Structure</h2>
<div class="outline-text-2" id="text-orgd144e7c">
</div>
</section>
<section id="slide-orga9d0b22">
<h3 id="orga9d0b22">Array</h3>
</section>
<section id="slide-orga8cbdb9">
<h3 id="orga8cbdb9">String</h3>
</section>
<section id="slide-orgb734fd3">
<h3 id="orgb734fd3">Structure</h3>
</section>
<section id="slide-org52338ba">
<h3 id="org52338ba">Unions</h3>
</section>
<section id="slide-orgd8cfed0">
<h3 id="orgd8cfed0">Enumerations</h3>

</section>
</section>
<section>
<section id="slide-org1ce5f5e">
<h2 id="org1ce5f5e">Flow Control</h2>
<div class="outline-text-2" id="text-org1ce5f5e">
</div>
</section>
<section id="slide-org0b93dcd">
<h3 id="org0b93dcd">if</h3>
</section>
<section id="slide-orga0aaeca">
<h3 id="orga0aaeca">while</h3>
</section>
<section id="slide-org6a369fb">
<h3 id="org6a369fb">for</h3>
</section>
<section id="slide-org12f6cf7">
<h3 id="org12f6cf7">switch</h3>
</section>
</section>
<section>
<section id="slide-org9169e4f">
<h2 id="org9169e4f">Operators</h2>
<div class="outline-text-2" id="text-org9169e4f">
</div>
</section>
<section id="slide-orgfa36e19">
<h3 id="orgfa36e19">Arithmetic</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operations</th>
<th scope="col" class="org-left">Operators</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Addition</td>
<td class="org-left">+</td>
<td class="org-left">count + 10</td>
</tr>

<tr>
<td class="org-left">Subtraction</td>
<td class="org-left">-</td>
<td class="org-left">count - 10</td>
</tr>

<tr>
<td class="org-left">Multiplication</td>
<td class="org-left">*</td>
<td class="org-left">count * 10</td>
</tr>

<tr>
<td class="org-left">Division</td>
<td class="org-left">/</td>
<td class="org-left">count / 10</td>
</tr>

<tr>
<td class="org-left">Reminder</td>
<td class="org-left">%</td>
<td class="org-left">count % 10</td>
</tr>
</tbody>
</table>

<p>
Interger division always produce integer output for eg.
</p>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Used for output data to console</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
<span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"Division 7/2 = "</span> &lt;&lt; <span style="color: #a45bad;">7</span>/<span style="color: #a45bad;">2</span> &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
<span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"Reminder 7%2 = "</span> &lt;&lt; <span style="color: #a45bad;">7</span>%<span style="color: #a45bad;">2</span> &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
<span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Division</td>
<td class="org-right">7/2</td>
<td class="org-left">=</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Reminder</td>
<td class="org-right">7%2</td>
<td class="org-left">=</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

</section>
<section id="slide-org689c960">
<h4 id="org689c960">Prcedence of arithmetic operators</h4>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">order of evluation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">()</td>
<td class="org-left">Evaluated first.</td>
</tr>

<tr>
<td class="org-left">* /  %</td>
<td class="org-left">Evaluated second in left to right order</td>
</tr>

<tr>
<td class="org-left">+  -</td>
<td class="org-left">Evaluated last in left to right order</td>
</tr>
</tbody>
</table>
</section>
<section id="slide-org4e881d0">
<h3 id="org4e881d0">Increament and Decreament</h3>
<div class="outline-text-3" id="text-org4e881d0">
</div>
</section>
<section id="slide-orgf799fed">
<h4 id="orgf799fed">Postfix Increament</h4>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span> 
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> 
<span style="color: #4f97d7;">{</span>
   <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">total</span> = <span style="color: #a45bad;">0</span>;
   <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">count</span> = <span style="color: #a45bad;">5</span>;
  <span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"count\t"</span> &lt;&lt; count &lt;&lt; <span style="color: #a45bad;">std</span>::endl &lt;&lt; <span style="color: #2d9574;">"total\t"</span> &lt;&lt; total &lt;&lt; <span style="color: #a45bad;">std</span>::endl ;
  count = total++  + <span style="color: #a45bad;">20</span>; 
  <span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"count\t"</span> &lt;&lt; count &lt;&lt; <span style="color: #a45bad;">std</span>::endl &lt;&lt; <span style="color: #2d9574;">"total\t"</span> &lt;&lt; total  &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
  <span style="color: #4f97d7;">}</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">count</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">total</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">count</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">total</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</section>
<section id="slide-orgac4160d">
<h4 id="orgac4160d">Prefix Increament</h4>
<div class="org-src-container">

<pre  class="src src-C++"><span style="color: #bc6ec5;">#hinclude</span> <span style="color: #4f97d7;">&lt;</span>iostream<span style="color: #4f97d7;">&gt;</span> 
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> 
<span style="color: #4f97d7;">{</span>
   <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">total</span> = <span style="color: #a45bad;">0</span>;
   <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">count</span> = <span style="color: #a45bad;">5</span>;
  <span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"count\t"</span> &lt;&lt; count &lt;&lt; <span style="color: #a45bad;">std</span>::endl &lt;&lt; <span style="color: #2d9574;">"total\t"</span> &lt;&lt; total &lt;&lt; <span style="color: #a45bad;">std</span>::endl ;
  count = ++total+ <span style="color: #a45bad;">20</span>; 
  <span style="color: #a45bad;">std</span>::cout &lt;&lt; <span style="color: #2d9574;">"count\t"</span> &lt;&lt; count &lt;&lt; <span style="color: #a45bad;">std</span>::endl &lt;&lt; <span style="color: #2d9574;">"total\t"</span> &lt;&lt; total  &lt;&lt; <span style="color: #a45bad;">std</span>::endl;
  <span style="color: #4f97d7;">}</span>
</pre>
</div>


</section>
<section id="slide-org8317ee2">
<h3 id="org8317ee2">Comparison</h3>
<p>
For various logical condition checking we need to compare to variables using comparison operator.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Sample</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&gt;</td>
<td class="org-left">x &gt; y</td>
<td class="org-left">x is greater than y</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">x &lt; y</td>
<td class="org-left">x is less than y</td>
</tr>

<tr>
<td class="org-left">&gt;=</td>
<td class="org-left">x &gt;= y</td>
<td class="org-left">x is greater or equal to y</td>
</tr>

<tr>
<td class="org-left">&lt;=</td>
<td class="org-left">x &lt;=y</td>
<td class="org-left">x is less or equal to y</td>
</tr>

<tr>
<td class="org-left">==</td>
<td class="org-left">x == y</td>
<td class="org-left">if x is equal to y</td>
</tr>

<tr>
<td class="org-left">!=</td>
<td class="org-left">x != y</td>
<td class="org-left">if x is not equal to y</td>
</tr>
</tbody>
</table>

<p>
Reversing order of operators may cause complier to emit syntax error. But some operator like != when 
written like <code>! will be logical error.
Also equality operator =</code> when written like = will be logical error.
</p>
</section>
<section id="slide-org91b41d2">
<h4 id="org91b41d2">Prcedence of comparison operators</h4>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">order of evluation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">()</td>
<td class="org-left">Evaluated first.</td>
</tr>

<tr>
<td class="org-left">* /  %</td>
<td class="org-left">Evaluated second in left to right order</td>
</tr>

<tr>
<td class="org-left">&lt;&lt; &gt;&gt;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&lt; &lt;= &gt; &gt;=</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>= !</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">=</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

</section>
